Embedfire-rt1021/ebf_i.mxrt1021_code/RT1021_SEMC_LCD8080_Camera/user/pin_mux.c
		/* Cameara pin mux and pad configurations. */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_09_FLEXIO1_FLEXIO06, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_FLEXIO1_FLEXIO02, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0U);
		IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 1U);
 
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_FLEXIO1_FLEXIO08, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_FLEXIO1_FLEXIO09, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_FLEXIO1_FLEXIO10, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_FLEXIO1_FLEXIO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_FLEXIO1_FLEXIO12, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_FLEXIO1_FLEXIO13, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_FLEXIO1_FLEXIO14, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_FLEXIO1_FLEXIO15, 0U);

    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_09_FLEXIO1_FLEXIO06, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_13_FLEXIO1_FLEXIO02, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0x10B0u);
		IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0x8B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_07_FLEXIO1_FLEXIO08, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_06_FLEXIO1_FLEXIO09, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_05_FLEXIO1_FLEXIO10, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_04_FLEXIO1_FLEXIO11, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_FLEXIO1_FLEXIO12, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_02_FLEXIO1_FLEXIO13, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_01_FLEXIO1_FLEXIO14, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_00_FLEXIO1_FLEXIO15, 0x10B0u);
    
//    /* LCD and touch panel pin mux and pad configurations. */
//    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_LPSPI3_PCS0, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_34_GPIO3_IO02, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_GPIO3_IO20, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_GPIO3_IO21, 0U);
//    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO3_IO22, 0U);

//    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_13_LPSPI3_PCS0, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_34_GPIO3_IO02, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_GPIO3_IO20, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_GPIO3_IO21, 0x10B0u);
//    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_GPIO3_IO22, 0x10B0u);
}
void BOARD_Init_I2C_Pins(void) {
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_LPI2C1_SCL, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_LPI2C1_SDA, 1U);
    
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_14_LPI2C1_SCL, 0xD8B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_15_LPI2C1_SDA, 0xD8B0u);
}

void BOARD_Init_I2C_GPIO_Pins(void) {
    gpio_pin_config_t gpio_pin_config ={
        .direction = kGPIO_DigitalOutput,
        .outputLogic = 1U,
        .interruptMode = kGPIO_NoIntmode
    };

    GPIO_PinInit(BOARD_I2C_SCL_GPIO_BASE, BOARD_I2C_SCL_PIN_INDEX, &gpio_pin_config);
    GPIO_PinInit(BOARD_I2C_SDA_GPIO_BASE, BOARD_I2C_SDA_PIN_INDEX, &gpio_pin_config);
    
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_18_GPIO2_IO18, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_19_GPIO2_IO19, 0U);
    
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_18_GPIO2_IO18, 0xF8B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_19_GPIO2_IO19, 0xF8B0u);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
